e2e/artillery-vite.yml
# https://www.artillery.io/docs/guides/guides/test-script-reference
config:
  target: "http://localhost:5173"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: vite main page
    flow:
      - get:
          url: /